/*
Вариант B
2. Ввести n чисел с консоли.
Вывести элементы массива в обратном порядке
*/
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите количество чисел: ");
        int size = scanner.nextInt();
        int num = 0;
        int[] nums = new int[size];
        System.out.print("Введите числа: ");
        for (int i = 0; i < size; i++) {
            num = scanner.nextInt();
            nums[i] = num;
        }
        System.out.print("Числа в обратном порядке: ");
        for (int i = size-1; i >= 0; i--) {
            System.out.print(nums[i] + " ");
        }
    }
}
